Программа "треугольник"
=======================
Программа принимает на вход три целых или вещественных числа в виде аргументов командной строки и в стандартном 
потоке вывода сообщает пользователю о том, существует ли треугольник с указанными длинами сторон или нет. 
Если существующий треугольник равнобедренный, равносторонний или прямоугольный, то программа также сообщает об этом.

Описание входных данных
=======================
Три целых или вещественных числовых параметра, например, triangle 1 2 3.
Вещественные значения длин сторон обрабатываются с точностью 5*10^-6.

Описание выходных данных
========================
Программа выводит следующие сообщения:

Если число аргументов отлично от трёх:
- "Необходимо указать ровно три входных параметра"

Если хотя бы один из аргументов не задаёт длину стороны:
- "Значение длин сторон треугольника должно принадлежать множеству положительных вещественных или целых чисел"

Если треугольник с заданными длинами сторон невозможен:
- "Треугольник не существует"

Если треугольник существует:
- "Треугольник существует".
- "Треугольник существует"."Равносторонний треугольник"
- "Треугольник существует". "Равнобедренный треугольник"
- "Треугольник существует"."Прямоугольный треугольник"
